{
  "questions": [
    "Find out the cases where above devices are used?",
    "Differentiate each device?",
    "Give approximate cost of each device with name of 2 manufactures.",
    "Find out the cases where above cables are used?",
    "Differentiate each device.",
    "Give approximate cost of each cable with name of 2 manufactures.",
    "Give the sequence of troubleshoots commands you will perform with proper justification if your network is not working.",
    "Give Advantages, disadvantages of each topology",
    "Find out application case of each topology",
    "Which topology you will implement in your campus and why?",
    "Give Advantages, disadvantages of VLAN",
    "Find out application case of VLAN",
    "Give Advantages, disadvantages of Static routing",
    "Find out application case of Static routing",
    "What is Ethernet?",
    "Differentiate static and dynamic algorithm",
    "What is the approximate cost of establishing the network of 10 devices? (Take devices as per your requirements and choice) give details",
    "Explain the significance of a web server in the context of internet communication.",
    "Outline the general steps involved in simulating web server configuration using Cisco Packet Tracer.",
    "Explain various planes or windows shown in user interface of Wireshark tool",
    "What is the use of Wireshark tool?",
    "Explore various important options available in Wireshark tool"
  ],
  "context": "\nA Laboratory Manual for\n\n\nComputer Networks\n(3150710)\n\nB.E. Semester 5\n(Computer Engineering)\n\n\n\n\n\n\n\nDirectorate of Technical Education, Gandhinagar, Gujarat\nVishwakarma Government Engineering College Chandkheda\nComputer Engineering Department\nCertificate\n\nThis is to certify that\nMr./Ms. Patel Abhi Yogeshkumar of class Computer Engineering Division G, Enrollment No. 220170107079 Has satisfactorily completed his/her term work in Computer Networks Subject for the term ending in 2024-25.\nDate:-\n\n\n\n\n\nSignature of Teacher\t\t\t\t\t     Head of Department\n\n\nPreface\n\nMain motto of any laboratory/practical/field work is for enhancing required skills as well as creating ability amongst students to solve real time problem by developing relevant competencies in psychomotor domain. By keeping in view, GTU has designed competency focused outcome-based curriculum for engineering degree programs where sufficient weightage is given to practical work. It shows importance of enhancement of skills amongst the students and it pays attention to utilize every second of time allotted for practical amongst students, instructors and faculty members to achieve relevant outcomes by performing the experiments rather than having merely study type experiments. It is must for effective implementation of competency focused outcome-based curriculum that every practical is keenly designed to serve as a tool to develop and enhance relevant competency required by the various industry among every student. These psychomotor skills are very difficult to develop through traditional chalk and board content delivery method in the classroom. Accordingly, this lab manual is designed to focus on the industry defined relevant outcomes, rather than old practice of conducting practical to prove concept and theory.\n\nBy using this lab manual students can go through the relevant theory and procedure in advance before the actual performance which creates an interest and students can have basic idea prior to performance. This in turn enhances pre-determined outcomes amongst students. Each experiment in this manual begins with competency, industry relevant skills, course outcomes as well as practical outcomes (objectives). The students will also achieve safety and necessary precautions to be taken while performing practical.\n\nThis manual also provides guidelines to faculty members to facilitate student centric lab activities through each experiment by arranging and managing necessary resources in order that the students follow the procedures with required safety and necessary precautions to achieve the outcomes. It also gives an idea that how students will be assessed by providing rubrics. \n\nUtmost care has been taken while preparing this lab manual however always there is chances of improvement. Therefore, we welcome constructive suggestions for improvement and removal of errors if any. \n\nPractical – Course Outcome matrix\n\n\nIndustry Relevant Skills\n\nThe following industry relevant competencies are expected to be developed in the student by undertaking the practical work of this laboratory.\nIdentify, connect various network devices. \nPrepare LAN cable\nConfiguration network and understand protocols behaviors on simulator.\n\nGuidelines for Faculty members\nTeacher should provide the guideline with demonstration of practical to the students with all features.\nTeacher shall explain basic concepts/theory related to the experiment to the students before starting of each practical\nInvolve all the students in performance of each experiment.\nTeacher is expected to share the skills and competencies to be developed in the students and ensure that the respective skills and competencies are developed in the students after the completion of the experimentation.\nTeachers should give opportunity to students for hands-on experience after the demonstration.\nTeacher may provide additional knowledge and skills to the students even though not covered in the manual but are expected from the students by concerned industry.\nGive practical assignment and assess the performance of students based on task assigned to check whether it is as per the instructions or not.\nTeacher is expected to refer complete curriculum of the course and follow the guidelines for implementation.\n\nInstructions for Students\nStudents are expected to carefully listen to all the theory classes delivered by the faculty members and understand the COs, content of the course, teaching and examination scheme, skill set to be developed etc.\nStudents shall organize the work in the group and make record of all observations.\nStudents shall develop maintenance skill as expected by industries.\nStudent shall attempt to develop related hand-on skills and build confidence.\nStudent shall develop the habits of evolving more ideas, innovations, skills etc. apart from those included in scope of manual.\nStudent shall refer technical magazines and data books.\nStudent should develop a habit of submitting the experimentation work as per the schedule and s/he should be well prepared for the same. \n\n\nIndex\n(Progressive Assessment Sheet)\n\n\n\n\n\n\n\n\n\n\nExperiment No: 1\n\nAIM: Study of different Network devices\n\nDate:\n\nCompetency and Practical Skills: Identify, connect various network devices. \n\nRelevant CO: CO1: Familiarize with the basic taxonomy - terminologies used in networking and the layered architecture of computer networks\n\n\nObjectives:  (a) to observe various network devices\n\t          (b) Find out usage of each in different case with advantage and disadvantage\n                   (c) Connect devices to establish network of two or more devices \n\nEquipment/Instruments: Desktop/laptop, Hub, Switch, Router, Bridge, Gateway, Modem, Repeater, NIC\n\n\nTheory: \nRef:  http://swayam.gov.in/ \nComputer Networking- A Top-Down approach (6th edition), Kurose and Ross, Pearson\n\nObservations: (Give detailed answer of each question with required figure)\n\nHub: \nWhat is hub?\nFeatures of Hub:\t\nApplications of Hub:\nTypes of Hub:\nA Hub is a basic networking device used to connect multiple Ethernet devices in a local area network (LAN). It operates at the physical layer (Layer 1) of the OSI model and is primarily used to transmit data packets to all connected devices, regardless of the intended recipient. Hubs are simplistic devices that do not manage or filter traffic, making them less intelligent compared to switches and routers.\n\nFeatures of a Hub:\n\nBroadcast Transmission: A hub transmits data packets to all connected devices, which can lead to unnecessary network traffic and potential collisions.\nSimple Device: Hubs are straightforward and easy to use, with no need for configuration.\nOperates at Layer 1: Being a Layer 1 device, hubs do not process any data, ensuring that all packets are simply repeated to other ports.\nNo Traffic Filtering: Hubs do not filter traffic, which means that every device connected to the hub receives all the data packets sent over the network.\nHalf-Duplex Communication: Hubs typically support half-duplex communication, meaning devices can either send or receive data at one time, but not both simultaneously.\nLimited Security: Due to the broadcast nature of data transmission, hubs do not offer any security features for data filtering or protection.\n\nApplications of a Hub:\n\nSmall Home Networks: Hubs are suitable for small home or office networks where simplicity and ease of use are prioritized over performance.\nLegacy Systems: In environments where older networking hardware is still in use, hubs may be employed due to compatibility.\nNetwork Monitoring: Hubs can be used in network monitoring setups where data needs to be captured for analysis since they broadcast all packets to all connected devices.\nDevice Connectivity: Hubs can serve as a simple way to connect multiple devices in a local area network when advanced network management is not required.\n\nTypes of Hubs:\n\nPassive Hub:\nFunctionality: Simply connects the various devices on the network and passes the electrical signals to other devices without any amplification or regeneration.\nFeatures: Does not require a power source; does not strengthen or clean the signal.\nUse Case: Suitable for small networks where the distance between devices is short.\nActive Hub:\nFunctionality: Amplifies and regenerates the signal before broadcasting it to the network, ensuring the data can travel longer distances without degradation.\nFeatures: Requires a power source; provides better performance than passive hubs.\nUse Case: Used in larger networks where the signal needs to be strengthened to reach all devices.\nIntelligent Hub:\nFunctionality: Includes additional features such as remote management capabilities, diagnostics, and monitoring.\nFeatures: Provides some level of network management and can help in troubleshooting network issues.\nUse Case: Used in more complex networks where monitoring and management of the network is essential.\n\nFigure:\n\t\n\nRouter\n\nA router is a networking device that forwards data packets between computer networks, directing traffic on the Internet. It operates at the network layer (Layer 3) of the OSI model and uses IP addresses to determine the best path for forwarding the packets. Routers connect multiple networks together, such as connecting a local area network (LAN) to the Internet.\n\nFeatures of a Router:\n\nTraffic Direction: Routers analysed incoming data packets and determine the best path for them to reach their destination.\nNetwork Layer Operations: Operates at the network layer, handling IP addresses and routing protocols.\nSecurity: Provides features such as firewalls, VPNs, and filtering to secure the network.\nDynamic Routing: Supports routing protocols like OSPF, BGP, and RIP to dynamically adjust routes based on current network conditions.\nStatic Routing: Allows manual configuration of routes for predictable and stable network performance.\nNetwork Address Translation (NAT): Enables multiple devices on a local network to share a single public IP address.\nQuality of Service (QoS): Manages network traffic to ensure performance for critical applications and services.\nWireless Connectivity: Many modern routers include Wi-Fi capabilities to provide wireless network access.\n\nApplications of a Router:\n\nInternet Connectivity: Connects home and office networks to the Internet.\nInter-Network Communication: Connects different networks, such as LANs, WANs, and MANs, allowing communication between them.\nNetwork Segmentation: Divides large networks into smaller, more manageable segments, improving performance and security.\nRemote Access: Provides VPN services for secure remote access to the network.\nLoad Balancing: Distributes network traffic across multiple paths or servers to optimize performance.\nNetwork Management: Enables monitoring and management of network traffic, security, and performance.\n\nTypes of Routers:\n\nCore Router:\nFunctionality: Operates within the core of a network, handling large amounts of data and directing traffic within the network backbone.\nFeatures: High-speed processing, multiple high-bandwidth interfaces, advanced routing protocols.\nUse Case: Used by ISPs and large enterprises to manage the primary network infrastructure.\nEdge Router:\nFunctionality: Connects an internal network to external networks, such as the Internet or other WANs.\nFeatures: Supports a variety of WAN technologies, interfaces for external connections, and security features.\nUse Case: Placed at the edge of a network to manage traffic entering and exiting the network.\nHome Router:\nFunctionality: Provides Internet access to devices within a home or small office network.\nFeatures: Integrated Wi-Fi, NAT, DHCP server, basic security features.\nUse Case: Commonly used in residential and small business environments to connect devices to the Internet.\nWireless Router:\nFunctionality: Combines the features of a router with a wireless access point.\nFeatures: Wi-Fi connectivity, multiple SSIDs, guest networks, security protocols like WPA3.\nUse Case: Used in homes, offices, and public places to provide wireless Internet access.\nVirtual Router:\nFunctionality: Runs as software on a server or in a virtualized environment, providing routing functions without dedicated hardware.\nFeatures: Scalability, flexibility, cost-effectiveness, integration with virtual networks.\nUse Case: Deployed in data centres, cloud environments, and for virtualized network functions.\nBranch Router:\nFunctionality: Connects branch offices to the main corporate network.\nFeatures: VPN support, WAN optimization, security features, local breakout for Internet traffic.\nUse Case: Used by enterprises to connect remote or branch offices to the central network.\nFigure:\n\n\n\nBridge\n\nA bridge is a networking device that connects and filters traffic between two or more network segments, typically within a local area network (LAN). Operating at the data link layer (Layer 2) of the OSI model, bridges use MAC addresses to forward data to the correct destination, reducing network traffic and collisions.\n\nFeatures of a Bridge:\n\nMAC Address Filtering: Bridges use MAC addresses to determine the destination of frames and forward them to the appropriate segment.\nTraffic Reduction: By dividing a network into segments, bridges reduce overall traffic and minimize collisions.\nTransparent Operation: Bridges operate transparently to connected devices, meaning no special configuration is needed on the end devices.\nLearning and Forwarding: Bridges learn the MAC addresses of devices on each network segment and build a forwarding table to efficiently direct traffic.\nLoop Prevention: Modern bridges use protocols like Spanning Tree Protocol (STP) to prevent network loops, ensuring a loop-free network topology.\nStore-and-Forward: Bridges typically use the store-and-forward method, where they receive the entire frame before forwarding it, allowing error checking.\n\nApplications of a Bridge:\n\nNetwork Segmentation: Bridges are used to divide large networks into smaller, more manageable segments, improving performance and reducing collisions.\nTraffic Isolation: Bridges can isolate network traffic between segments, ensuring that local traffic remains within its segment and does not burden the entire network.\nExtending Networks: Bridges can connect two separate LANs, extending the reach of the network without requiring significant changes to the existing infrastructure.\nLegacy Network Integration: Bridges can connect different types of network segments, such as Ethernet and Token Ring, allowing for the integration of older and newer network technologies.\nImproved Security: By segmenting the network, bridges can help contain broadcast traffic and reduce the spread of network attacks within segments.\n\nTypes of Bridges:\n\nTransparent Bridge:\nFunctionality: Operates transparently to network devices, learning MAC addresses and building a forwarding table without requiring any configuration.\nFeatures: Uses MAC addresses to forward frames, operates using the store-and-forward method, and can implement STP.\nUse Case: Commonly used in Ethernet networks to segment and manage traffic without requiring changes to network devices.\n\nSource-Route Bridge:\nFunctionality: Used primarily in Token Ring networks, this bridge uses source routing information contained in frames to determine the path to the destination.\nFeatures: Relies on the sending device to include routing information in the frame, can handle complex topologies.\nUse Case: Suitable for Token Ring networks and environments where source routing is preferred.\nTranslational Bridge:\nFunctionality: Connects different types of network segments, such as Ethernet to Token Ring or FDDI to Ethernet.\nFeatures: Converts frames from one type of network protocol to another, allowing interoperability between different network types.\nUse Case: Used to integrate networks with different architectures, enabling communication between disparate systems.\nFigure: \n\n\nGateway\n\nA gateway is a network node that serves as an access point to another network, often with a different protocol. It acts as a translator between different network protocols, facilitating communication and data transfer between disparate networks. Gateways operate at various layers of the OSI model, but they typically function at the network layer (Layer 3) and above.\n\nFeatures of a Gateway:\n\nProtocol Conversion: Gateways convert data from one protocol to another, enabling communication between different network architectures.\nNetwork Access Point: They act as entry and exit points for a network, managing traffic that enters or leaves the network.\nRouting Capabilities: Gateways can route data between different networks, similar to routers.\nSecurity: They often include security features such as firewalls, VPN support, and intrusion detection/prevention systems.\nTraffic Management: Gateways can prioritize and manage traffic to optimize network performance.\nTranslation Services: They provide translation services for different data formats, message formats, and network protocols.\nInteroperability: Ensures different network systems and devices can communicate effectively, despite differences in protocols or architecture.\n\nApplications of a Gateway:\n\nInternet Access: Gateways provide access to the Internet for devices within a local network.\nEnterprise Networks: They connect different parts of an enterprise network, such as connecting a corporate LAN to a WAN.\nCloud Services: Gateways connect local networks to cloud services and platforms, enabling seamless data transfer and communication.\nIoT Networks: Gateways facilitate communication between IoT devices using different protocols.\nUnified Communications: They enable integration of various communication systems like VoIP, email, and instant messaging.\nCross-Protocol Communication: Gateways allow different systems, such as a mainframe and a client-server network, to communicate and exchange data.\n\nTypes of Gateways:\n\nNetwork Gateway:\nFunctionality: Acts as an entry and exit point for a network, providing protocol translation and routing services.\nFeatures: Protocol conversion, routing capabilities, traffic management, and security features.\nUse Case: Commonly used to connect a local network to the Internet or other external networks.\nApplication Gateway (Proxy Server):\nFunctionality: Serves as an intermediary between clients and servers, providing application-specific data processing.\nFeatures: Content filtering, caching, user authentication, and logging.\nUse Case: Used for web traffic management, email filtering, and securing application-level communication.\nVoIP Gateway:\nFunctionality: Converts voice and fax calls between the public switched telephone network (PSTN) and an IP network.\nFeatures: Protocol translation, call routing, compression, and echo cancellation.\nUse Case: Deployed in VoIP systems to enable voice communication over IP networks.\nIoT Gateway:\nFunctionality: Facilitates communication between IoT devices and the cloud or other networks.\nFeatures: Protocol translation, data aggregation, security, and device management.\nUse Case: Used in IoT deployments to connect sensors and devices to cloud services for data analysis and control.\nCloud Storage Gateway:\nFunctionality: Connects local storage systems to cloud storage services, providing seamless integration and data transfer.\nFeatures: Data compression, encryption, deduplication, and protocol translation.\nUse Case: Used in hybrid cloud environments to enable local applications to access cloud storage transparently.\nAPI Gateway:\nFunctionality: Manages and routes API requests from clients to appropriate microservices or backend services.\nFeatures: Rate limiting, authentication, load balancing, and logging.\nUse Case: Commonly used in microservices architectures to provide a single-entry point for API consumers.\nFigure: \n\n\nModem\n\nA modem (modulator-demodulator) is a hardware device that converts digital data from a computer or other digital device into an analog signal suitable for a telephone line or other analog medium and vice versa. This allows digital information to be transmitted over analog communication channels, such as telephone lines or cable systems.\n\nFeatures of a Modem:\n\nModulation and Demodulation: Converts digital signals to analog signals (modulation) for transmission and converts received analog signals back to digital signals (demodulation).\nData Compression: Reduces the size of data to increase transmission speed and efficiency.\nError Correction: Detects and corrects errors in the transmitted data to ensure accurate communication.\nSpeed: Measured in bits per second (bps), indicating the rate at which data is transmitted.\nProtocol Support: Supports various communication protocols for data transmission.\nInterface: Provides interfaces such as Ethernet, USB, or serial ports for connecting to computers or routers.\nConfiguration: Can be configured through software or firmware settings to optimize performance and compatibility.\n\nApplications of a Modem:\n\nInternet Access: Provides Internet connectivity by converting digital data from a computer to analog signals for transmission over telephone lines or cable systems.\nRemote Access: Enables remote access to networks or computers via dial-up connections.\nFax Transmission: Allows computers to send and receive fax messages over telephone lines.\nPoint-of-Sale Systems: Used in POS systems to transmit transaction data over phone lines.\nTelemetry: Used in telemetry systems to transmit data from remote sensors or devices to a central location.\n\nTypes of Modems:\n\nDial-Up Modem:\nFunctionality: Connects to the Internet via a standard telephone line using the public switched telephone network (PSTN).\nFeatures: Typically supports speeds up to 56 Kbps, requires dial-up service from an ISP.\nUse Case: Used in areas with limited broadband availability or for specific low-bandwidth applications.\nDSL Modem:\nFunctionality: Connects to the Internet using a digital subscriber line (DSL) over existing telephone lines.\nFeatures: Higher speeds than dial-up (ranging from a few Mbps to hundreds of Mbps), supports simultaneous voice and data transmission.\nUse Case: Common in residential and small business Internet setups where DSL service is available.\nCable Modem:\nFunctionality: Connects to the Internet via a cable television network.\nFeatures: Supports high-speed Internet access, typically offering speeds from several Mbps to several Gbps.\nUse Case: Widely used in residential areas with cable TV infrastructure for broadband Internet access.\nFiber Optic Modem (ONT):\nFunctionality: Connects to the Internet using fiber optic cables, also known as an Optical Network Terminal (ONT).\nFeatures: Provides extremely high-speed Internet access, often in the range of hundreds of Mbps to several Gbps.\nUse Case: Used in areas with fiber optic infrastructure for the fastest Internet speeds available.\nSatellite Modem:\nFunctionality: Connects to the Internet via satellite communication.\nFeatures: Provides Internet access in remote or rural areas where other forms of broadband are unavailable.\nUse Case: Suitable for remote locations, maritime applications, and areas with limited terrestrial Internet infrastructure.\nWireless Modem:\nFunctionality: Connects to the Internet using wireless cellular networks (e.g., 3G, 4G, 5G).\nFeatures: Portable, often integrated into mobile devices, supports various wireless standards.\nUse Case: Used for mobile Internet access and in areas without wired broadband infrastructure.\nISDN Modem:\nFunctionality: Connects to the Internet using Integrated Services Digital Network (ISDN) lines.\nFeatures: Supports digital transmission over telephone lines, offering speeds higher than traditional dial-up but lower than DSL.\nUse Case: Used in specific business applications where ISDN infrastructure is available.\nFigure: \n\n\n\nRepeater \n\nA repeater is a network device used to regenerate or amplify signals to extend the distance over which data can travel. It operates at the physical layer (Layer 1) of the OSI model, receiving and retransmitting signals to ensure that they do not degrade or become weak over long distances. Repeaters are essential in maintaining signal integrity across extended lengths of cabling or wireless connections.\n\nFeatures of a Repeater:\n\nSignal Amplification: Boosts the strength of the incoming signal to overcome the distance limitations of transmission media.\nNoise Filtering: Minimizes noise and distortion in the signal to ensure clear and accurate data transmission.\nBit-Level Regeneration: Reconstructs the signal at the bit level, ensuring that data integrity is maintained without errors.\nBidirectional: Capable of amplifying signals in both directions, ensuring communication continuity.\nTransparent Operation: Functions without altering the data content, making it invisible to network protocols and devices.\n\nApplications of a Repeater:\n\nExtended LANs: Used to extend the range of local area networks (LANs) by amplifying signals over longer distances.\nLong-Distance Communication: Facilitates communication over long distances in wide area networks (WANs) by maintaining signal strength.\nWireless Networks: Enhances the range and coverage of wireless networks by boosting weak signals.\nSatellite Communication: Used in satellite communication systems to amplify signals transmitted to and from satellites.\nTelecommunication Systems: Essential in telephone networks to maintain voice signal quality over long distances.\n\nTypes of Repeaters:\n\nAnalog Repeater:\nFunctionality: Amplifies analog signals to extend their range.\nFeatures: Simple amplification without digital processing, prone to amplifying noise along with the signal.\nUse Case: Used in older telecommunication systems and analog broadcast systems.\nDigital Repeater:\nFunctionality: Regenerates digital signals, reconstructing them to their original quality.\nFeatures: Error detection and correction, bit-level regeneration, better noise immunity.\nUse Case: Commonly used in digital networks, including modern telecommunication systems and data networks.\nWi-Fi Repeater (Wireless Range Extender):\nFunctionality: Extends the range of Wi-Fi networks by receiving and retransmitting wireless signals.\nFeatures: Can be configured easily, supports various Wi-Fi standards, improves coverage in large areas or buildings.\nUse Case: Used in homes, offices, and public spaces to enhance wireless network coverage.\nOptical Repeater:\nFunctionality: Regenerates optical signals in fiber optic communication systems.\nFeatures: Converts optical signals to electrical signals for amplification and then back to optical signals.\nUse Case: Essential in long-distance fiber optic communication to maintain signal strength and quality.\nTelephone Repeater:\nFunctionality: Amplifies voice signals in telephone lines to extend the distance of telecommunication.\nFeatures: Ensures clear voice communication over long distances, compensates for signal loss.\nUse Case: Used in telecommunication systems, particularly in long-distance and international telephone networks.\n\nFigure:\n\n7. NIC:\n\tA Network Interface Card (NIC) is a hardware component that allows a computer or other devices to connect to a network. It can be integrated into the motherboard or added as an expansion card. NICs facilitate communication between devices on a local area network (LAN) or a larger network by providing the physical interface for data transmission and reception.\n\nFeatures of a NIC:\n\nMAC Address: Each NIC has a unique Media Access Control (MAC) address, which is used for identifying devices on the network.\nSpeed: NICs support various data transfer speeds, such as 10 Mbps, 100 Mbps, 1 Gbps, 10 Gbps, and higher.\nFull-Duplex and Half-Duplex: NICs can operate in full-duplex mode (simultaneous send and receive) or half-duplex mode (send and receive alternately).\nWired and Wireless: NICs can be wired (Ethernet) or wireless (Wi-Fi), depending on the network infrastructure.\nBus Interface: NICs connect to the computer via different bus interfaces, such as PCI, PCIe, USB, or integrated directly onto the motherboard.\nProtocol Support: NICs support various network protocols, including TCP/IP, which is fundamental for Internet connectivity.\nWake-on-LAN (WoL): Some NICs support Wake-on-LAN, allowing a computer to be powered on remotely.\nQuality of Service (QoS): Advanced NICs support QoS features to prioritize network traffic for better performance.\n\nApplications of a NIC:\n\nInternet Connectivity: Provides the interface for connecting a computer to the Internet via an Ethernet cable or Wi-Fi.\nLocal Area Networks (LANs): Facilitates communication between devices within a local network, such as in homes, offices, or campus environments.\nFile Sharing and Printing: Enables networked devices to share files and access network printers.\nGaming: Ensures high-speed, low-latency connections for online gaming.\nEnterprise Networks: Used in business environments for connecting workstations, servers, and other network devices.\nVirtualization: Provides network connectivity for virtual machines in virtualized environments.\n\n\nTypes of NICs:\n\nEthernet NIC:\nFunctionality: Connects devices to wired Ethernet networks.\nFeatures: Supports various Ethernet standards (e.g., 10BASE-T, 100BASE-TX, 1000BASE-T).\nUse Case: Commonly used in desktop computers, servers, and switches for reliable wired network connections.\nWireless NIC (Wi-Fi Adapter):\nFunctionality: Connects devices to wireless networks.\nFeatures: Supports various Wi-Fi standards (e.g., 802.11a/b/g/n/ac/ax).\nUse Case: Used in laptops, smartphones, tablets, and desktop computers for wireless connectivity.\nFiber Optic NIC:\nFunctionality: Connects devices to fiber optic networks.\nFeatures: Supports high-speed data transfer over long distances using fiber optic cables.\nUse Case: Used in data centers, enterprise networks, and high-performance computing environments.\nUSB NIC:\nFunctionality: Provides network connectivity via a USB interface.\nFeatures: Portable, plug-and-play, supports both wired (Ethernet) and wireless (Wi-Fi) connections.\nUse Case: Used in laptops, tablets, and other devices that lack built-in NICs or need additional network interfaces.\nVirtual NIC:\nFunctionality: Provides network connectivity for virtual machines (VMs) in virtualized environments.\nFeatures: Software-based, allows VMs to communicate with each other and external networks.\nUse Case: Used in virtualization platforms like VMware, Hyper-V, and KVM.\n \n\nQuiz: (Sufficient space to be provided for the answers)\n\n1. Find out the cases where above devices are used?\n2. Differentiate each device? \n3. Give approximate cost of each device with name of 2 manufactures.\n\t\t\n\nReferences used by the students: \n\nhttps://www.geeksforgeeks.org/network-devices-hub-repeater-bridge-switch-router-gateways/\n\n\n\n\n\n\nRubric wise marks obtained:\n\n\n\n\n\n\n\n\n\nExperiment No: 2\n\nAIM: Study of different types of network cables and practically implements the cross-wired cable and straight through cable using clamping tool\nDate:\n\nCompetency and Practical Skills: Identify different types of network cables and Prepare own LAN Cable\n\nRelevant CO: CO1: Familiarize with the basic taxonomy - terminologies used in networking and the layered architecture of computer networks\n\nObjectives:  (a) To see and check various network Cables.\n\t          (b) Find out usage of each in different case with advantage and disadvantage\n                      (c) Prepare own cross-wired cable and straight through cable using clamping tool.\n\n\nEquipment/Instruments: RJ-45 connector, Clamping Tool, Twisted pair Cable\n\nTheory:\n\nStudy four different types of cables:\n\nCoaxial Cable\nA coaxial cable is an electrical cable with a copper conductor and an insulator shielding around it and a braided metal mesh that prevents signal interference and cross talk.\nCoaxial cable is also known as coax.\nThe term coaxial refers to the inner conductor and the outer shield sharing a geometric axis.\n\nFig. 1.  Coaxial Cable\n\n\n\n\nStructure of coaxial cable:\n\nCopper conductor: A central conductor, which consists of copper. The conductor is the point at which data transmits.\n\nInsulator: Dielectric plastic insulation around the copper conductor. It is used to maintain the spacing between the center conductor and shield.\n\nBraided mesh: A braided mesh of copper helps to shield from electromagnetic interference, the braid provides a barrier against EMI moving into and out of the coaxial cable\n\nProtective plastic layer: An external polymer layer, which has a plastic coating. It is used to protect internal layers from damages.\n\nTypes of coaxial cables:\n\nHard line coaxial cable.\nFlexible coaxial cable.\nSemi-rigid coaxial cable.\nFormable coaxial cable.\nRigid coaxial cable.\nTwin axial cable.\nTriaxial cable.\n\nAdvantages:\nCoaxial cables have better cut-through resistance so they are more reliable and durable.\nLess affected by noise or cross-talk or electromagnetic inference.\nCoaxial cables support multiple channels\n\nDisadvantages:\nCoaxial cables are expensive.\nThe coaxial cable must be grounded in order to prevent any crosstalk.\nAs a Coaxial cable has multiple layers it is very bulky.\n\n\t\t\t\n       2. Twisted Pair Cable\n\t\tTwisted pair cables consist of pairs of wires twisted together to reduce electromagnetic interference (EMI) from external sources and crosstalk between neighboring pairs. This cable type is commonly used in telecommunications and networking applications, particularly for Ethernet networks.\n\nShielded Twisted Pair (STP) Cable\nConstruction: STP cables have an additional shielding (usually a foil or braided shield) around each pair of wires or around the overall cable, which helps to further reduce EMI and crosstalk.\nCommon Variants:\nIndividual Shielding: Each pair of wires is individually shielded.\nOverall Shielding: A single shield is placed around all pairs within the cable.\nCombination: Some cables may have both individual and overall shielding for maximum protection.\nFigure: \n\n\nAdvantages:\nImproved EMI Protection: The shielding provides superior protection against external interference and crosstalk, making it ideal for environments with high EMI.\nBetter Performance: Capable of maintaining signal integrity over longer distances and at higher speeds compared to UTP.\nDisadvantages:\nHigher Cost: Generally more expensive than UTP cables due to the additional materials and construction complexity.\nLess Flexible: The shielding adds bulk and rigidity, making the cable less flexible and harder to install.\nGrounding Issues: Improper grounding of the shield can lead to performance issues, including signal reflection and interference.\nApplications:\nIndustrial Environments: Used in environments with high levels of EMI, such as factories or data centers, where signal integrity is critical.\nHigh-Speed Networks: Suitable for applications requiring high data rates and long-distance transmission without signal degradation.\nSensitive Data Transmission: Preferred in situations where data security and integrity are paramount, due to the reduced risk of interference.\n\nUnshielded Twisted Pair (UTP) Cable\nConstruction: UTP cables consist of pairs of copper wires twisted together without any additional shielding. Each pair is twisted to different degrees to help minimize interference.\nCommon Categories:\nCat5e: Supports up to 1 Gbps Ethernet over distances up to 100 meters.\nCat6: Supports up to 10 Gbps Ethernet over short distances and 1 Gbps over 100 meters.\nCat6a: Enhanced version of Cat6, supports up to 10 Gbps over 100 meters.\nFigure:\n\nAdvantages:\nCost-Effective: Generally less expensive than STP and other types of cables.\nFlexibility: Easier to install and more flexible due to the absence of shielding.\nWidely Available: Standardized and widely used in many networking applications, making it readily available.\nDisadvantages:\nLess Protection: More susceptible to electromagnetic interference (EMI) and crosstalk compared to shielded cables.\nShorter Distance at High Speeds: Performance may degrade over longer distances, particularly at higher data rates.\nApplications:\nLocal Area Networks (LANs): Widely used in Ethernet networks for connecting computers, switches, routers, and other network devices.\nTelephone Networks: Commonly used in both traditional and VoIP telephone systems.\nResidential Cabling: Used for home networking and Internet connections.\n 3. Fiber Optical Cable\n\nFiber optical cables are advanced communication cables that use light to transmit data over long distances at high speeds. These cables consist of one or more optical fibers, which are thin strands of glass or plastic that carry light signals.\n\t\nStructure: Fiber optical cables are made up of several layers:\nCore: The innermost part of the fiber, made of glass or plastic, where the light travels.\nCladding: Surrounds the core and reflects light back into the core to prevent signal loss.\nBuffer Coating: Protects the fiber from moisture and physical damage.\nStrengthening Elements: Provide additional protection and tensile strength, usually made of Kevlar or other strong materials.\nOuter Jacket: The external layer that protects the cable from environmental damage.\nTypes:\nSingle-Mode Fiber (SMF): Has a small core (about 9 microns) and is designed for long-distance communication with higher bandwidth.\nMulti-Mode Fiber (MMF): Has a larger core (50-62.5 microns) and is used for shorter distances, typically within buildings or campuses.\nFigure:\n\n\tAdvantages of Fiber Optic Cables:\nHigh bandwidth for fast data transmission.\nLong-distance transmission with minimal signal loss.\nImmune to electromagnetic interference (EMI).\nEnhanced security, as tapping is difficult.\nLightweight and thinner than copper cables.\nDisadvantages:\nMore expensive than copper cables, including installation costs.\nFragile and prone to breaking if mishandled.\nComplex installation requiring specialized equipment and expertise.\nLess widespread infrastructure, especially in rural areas.\nApplications:\nInternet backbone and telecommunications infrastructure.\nData centres for fast data transfer.\nEnterprise networks for secure communication.\nMedical imaging and sensing.\n\n\nPatch Cable\n\tPatch cables are short-length cables used to connect devices to a network or to interconnect networking devices like switches, routers, and patch panels. They can be made from various types of cables, including twisted pair (UTP/STP) and fiber optic cables, depending on the specific application.\nStructure:\nTwisted Pair Patch Cable: Usually made from Cat5e, Cat6, or Cat6a UTP or STP cables, with RJ45 connectors on both ends.\nFiber Optic Patch Cable: Made from fiber optic cables with connectors such as LC, SC, or ST on both ends.\nLength: Typically ranges from 1 to 10 feet, but can be longer or shorter based on specific needs.\nConnectors: Terminated with connectors that match the devices they connect, like RJ45 for Ethernet, LC/SC for fiber optics, or others depending on the application.\nFigure:\n\nAdvantages:\nEasy to Use: Simple to connect and disconnect, making them ideal for temporary connections and quick changes in network configurations.\nVersatile: Available in various lengths, colors, and types, making it easy to organize and manage connections in networking setups.\nReliable Connections: Provides a stable and reliable connection between network devices, ensuring consistent data transfer.\nCost-Effective: Generally inexpensive and readily available, making them a practical choice for most networking needs.\nDisadvantages:\nLimited Length: Typically designed for short distances, so they are not suitable for long-range connections between network devices.\nPotential for Tangles: If not managed properly, patch cables can create a tangled mess, especially in environments with many connections, leading to difficult troubleshooting and maintenance.\nCable Management Issues: Overuse or poor organization of patch cables can lead to cluttered spaces, which can impact airflow in data centers and increase the risk of damage.\nApplications:\nNetworking Equipment Connections: Commonly used to connect networking devices such as switches, routers, and patch panels in network racks.\nEnd-User Device Connections: Used to connect computers, printers, and other network devices to wall outlets or network jacks.\nData Centers: Essential for connecting servers, storage devices, and networking equipment within data center racks.\nTelecommunications: Used in telecommunications rooms and setups to connect equipment, ensuring proper signal routing and management.\nRef:  http://swayam.gov.in/ \nComputer Networking- A Top-Down approach (6th edition), Kurose and Ross, Pearson\n\nProcedure to prepare cross-wired cable and straight through cable using clamping tool\n\nStart by stripping off about 2 inches of the plastic jacket off the end of the cable. Be very careful at this point, as to not nick or cut into the wires, which are inside. Doing so could alter the characteristics of your cable, or even worse render is useless. Check the wires, one more time for nicks or cuts. If there are any, just whack the whole end off, and start over.\n\nSpread the wires apart, but be sure to hold onto the base of the jacket with your other hand. You do not want the wires to become untwisted down inside the jacket. Category 5 cable must only have 1/2 of an inch of 'untwisted' wire at the end; otherwise it will be 'out of spec'. At this point, you obviously have ALOT more than 1/2 of an inch of un-twisted wire.\n\nYou have 2 end jacks, which must be installed on your cable. If you are using a pre-made cable, with one of the ends whacked off, you only have one end to install - the crossed over end. Below are two diagrams, which show how you need to arrange the cables for each type of cable end. Decide at this point which end you are making and examine the associated picture below.\n\nFollowing diagram shows you how to prepare Cross wired connection\n\n\nFig. 2.  Cross Wired Connections.\nFollowing diagram shows you how to prepare straight through wired connection\n\n\nFig. 3.  Straight Through Wired Connections.\n\n\nQuiz: (Sufficient space to be provided for the answers)\n\n1. Find out the cases where above cables are used?\n2. Differentiate each device. \n3. Give approximate cost of each cable with name of 2 manufactures.\n\n\nReferences used by the students\nhttps://www.bostonindia.in/blog/2019/05/01/network-cables-reference-guide.aspx\nhttps://www.geeksforgeeks.org/types-of-ethernet-cable/\n\n\nRubric wise marks obtained:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nExperiment No: 3\n\nAIM: Study of basic network command and Network configuration commands\n\nDate:\n\nCompetency and Practical Skills: Exploration of network commands to troubleshoot networking errors.\n\nRelevant CO: CO1: Familiarize with the basic taxonomy - terminologies used in networking and the layered architecture of computer networks\n\nObjectives: (a) To understand the usage of various network commands \n\t         (b) Perform commands with various options on given OS.\n                      (c) Prepare the report with screenshots/Output and analyze the usage of each command.\n\nEquipment/Instruments: Desktop/laptop\n\nTheory: \n\nThe operating system consists of various built-in, command-line networking utilities that are used for network troubleshooting. There are many various commands such as:\nPing\nIpconfig\nTracert\nHostname\nPathping\nRoute\nNslookup\nNetstat\nARP\nGetmac\n\nPing:\n\nThe ping command is also known as Packet Internet Groper.\nThe ping command is used to ensure that a computer can communicate to a specified device over the network. \nThe pings command sends Internet Control Message Protocol (ICMP) Echo Request messages in the form of packets to the destination computer and waits in order to get the response back. Once the packets are received by the destined computer, it starts sending the packets back. \nThis command keeps executing until it si interrupted. \nping command provides details such as\nnumber of packets transmitted\nnumber of packets received \ntime taken by the packet to return\n\nping command in generally used for the following purposes:\nmeasuring the time taken by the packets to return to determine the speed of the connection\nto make sure that the network connection between the host and the destined computer can be established\n\nThe ping command uses various options such as :\ntarget - This is the destination IP address or a hostname user want to ping.\n-a - This option resolves the hostname of an IP address target.\n-t - This ping command option will ping the target until you stop it by pressing Ctrl-C.\n-n count - This option is used to set the number of ICMP Echo Requests to send, from 1 to 4294967295. If -n is not specified, the ping command will return 4 by default.\n\n\n\nFig. 1.  Use of PING command to check connection\n\n\n\nFig. 2.  Use of PING command with “–a” option\n\nGetting Help\n\nIn any command mode, you can get a list of available commands by entering a question mark (?). \nRouter>?\n\nTo obtain a list of commands that begin with a particular character sequence, type in those characters followed immediately by the question mark (?).\nRouter#co?\nConfigure connect copy\n\nTo list keywords or arguments, enter a question mark in place of a keyword or argument. Include a space before the question mark.\nRouter#configure?\nmemory Configure from NV memory\nnetwork Configure from a TFTP network \nhost terminal Configure from the terminal\n\nYou can also abbreviate commands and keywords by entering just enough characters to make the command unique from other commands. For example, you can abbreviate the show command to sh.\n\nConfiguration Files\n\nAny time you make changes to the router configuration, you must save the changes to memory because if you do not they will be lost if there is a system reload or power outage. There are two types of configuration files: the running (current operating) configuration and the startup configuration.\nUse the following privileged mode commands to work with configuration files.\n\nconfigure terminal – modify the running configuration manually from the terminal.\n\nshow running-config – display the running configuration.\n\nshow startup-config – display the startup configuration.\n\ncopy running-config startup-config – copy the running configuration to the startup configuration.\n\ncopy startup-config running-config – copy the startup configuration to the running configuration.\n\nerase startup-config – erase the startup-configuration in NVRAM.\n\ncopy tftp running-config – load a configuration file stored on a Trivial File Transfer Protocol (TFTP) server into the running configuration.\n\ncopy running-config tftp – store the running configuration on a TFTP server.\n\n\t\nIP Address Configuration\n\nTake the following steps to configure the IP address of an interface. \n\nStep 1: Enter privileged EXEC mode:\nRouter>enable password\n\nStep 2: Enter the configure terminal command to enter global configuration mode. Router#config terminal\n\nStep 3: Enter the interface type slot/port (for Cisco 7000 series) or interface type port (for Cisco 2500 series) to enter the interface configuration mode.\nExample:\nRouter (config)#interface ethernet 0/1\n\nStep 4: Enter the IP address and subnet mask of the interface using the ip address ipaddress subnetmask command.\nExample,\nRouter (config-if) #ip address 192.168.10.1 255.255.255.0\n\nStep 5: Exit the configuration mode by pressing Ctrl-Z \nRouter(config-if) #[Ctrl-Z]\n\n\n(Give details of each command as above)\n\nObservations:\n\nQuiz: (Sufficient space to be provided for the answers)\n\n1.Give the sequence of troubleshoots commands you will perform with proper justification if your network is not working.\n\n\nSuggested Reference: https://www.cisco.com/c/en/us/td/docs/routers/nfvis/switch_command/b-nfvis-switch-command-reference.html\nReferences used by the students: https://www.cisco.com/c/en/us/td/docs/routers/nfvis/switch_command/b-nfvis-switch-command-reference.html\n\n\nRubric wise marks obtained:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nExperiment No: 4\n\nAIM: Implement different LAN topologies using Network Simulator\n\nDate:\n\nCompetency and Practical Skills: Exploration of network layout to connect devices with each other to establish network\n\nRelevant CO: CO-5 Implement different types of network using different tools and simulators\n\nObjectives:\t(a) Download network simulator – preferably cisco packet tracer \n                    (b) Implement topologies by configuring interconnecting devices and computing devices.\n(c) Analyze the performance of connecting devices in different ways \n\nEquipment/Instruments: Desktop/laptop, Network simulator\n\nTheory: \n\nWhat is Network Topology?\nThe arrangement of a network that comprises nodes and connecting lines via sender and receiver is referred to as network topology.\nThere are various types of topologies and they are:\nBus Topology\nStar Topology\nRing Topology\nMesh Topology\nHybrid Topology\n\n\nBus Topology: \n(Give details of each topology with advantages, disadvantages and applications.)\n\nBus topology using Packet Tracer:\n\nTake 4 switches, connect them through single cable.\nEach of the switches will be connected with an end device whose IP addresses are given.\nTo configure the IP addresses of  the devices “Click on the device for which you want to configure the IP address-> Click Desktop -> IP configuration -> Provide IP of your choice -> Press Tab for automatically having Subnet Mask which is: 255.0.0.0  for all the devices available in the topology. \nProvide IP addresses to all the End devices only and then you can send the data among these devices.\n\nFig. 1.  Bus Topology.\n\n\n\nFig. 2.  Static IP Configuration\n\n\nCheck the network by sending messages/packets from one device to another and check the status of the message as “Successful”. If the messages are not sent due to some reasons it will show “Failed” as the status of the message.\n\n\n\nFig. 3.  Bus topology configuration in simulator\n\n\n\n\nFig. 4.  Bus topology simulation \n\nStar Topology:\n\nA star topology is a topology for a Local Area Network (LAN) in which all nodes are individually connected to a central connection point, sort of a hub or a switch.\n\n\nStar Topology Using Packet Tracer:\n\nHave a single switch which will be the central node.\nAll the end devices are connected with the central switch so if any of the cable fail occurs it does not affect the whole system.\nConfigure the IP address of all the connected devices.\nSend messages to other devices connected to the same Switch.\nAs we can see in the below image we can send the messages from one device to another and we can also see the status of the message as “Successful” here. If the messages are not sent due to some reasons it will show “Failed” as the status of the message.\n\n\n\nFig. 5.  Star Topology.\n\n\n\nFig. 6.  Star Topology in simulator.\n\nRing Topology:\n\nIn this topology, it forms a ring connecting devices with exactly two neighboring devices.\nIt is a network configuration where device connections create a circular data path. In this each device is connected to with its exactly two neighboring devices, like points on a circle which forms like a ring structure. \nThe most common access method of ring topology is token passing.\n\n\n\nFig. 7.  Ring Topology.\n\nRing Topology using Packet Tracer:\n\nTake 4 switches and connect them with each other.\nEach of the hubs is connected with an end device whose IP addresses can be configured \nAfter configuring the IP addresses send messages to other devices connected in the Network.\nAs we can see in the below image we can send the messages from one device to another and also see the status of the message as “Successful” here. If the messages are not sent due to some reasons it will show “Failed” as the status of the message.\n\n\n\nFig. 8.  Ring Topology in simulator.\n\n4.   Mesh Topology:\n\nIn a mesh topology, every device is connected to another device via a particular channel.\nThere are two types of Mesh topologies:\nFully-connected Mesh Topology\nPartially-connected Mesh Topology\n\n\n\nFig. 9.  Mesh Topology\n\nMesh Topology using Packet Tracer:\n\n4 network switches which are connected to each other through network cables.\nEach of the switch is connected all the other switches as well as an end device.\nConfigure the end devices and then can send the message to any other device connected to particular network.\nAs we can see in the below image we can send the messages from one device to another and we can also see the status of the message as “Successful” here. If the messages are not sent due to some reasons it will show “Failed” as the status of the message.\n\n\n\nFig. 10.  Mesh Topology in simulator.\n5.   Hybrid Topology:\n\nA network structure whose design contains more than one topology is said to be hybrid topology. Hybrid topology inherits merits and demerits of all the incorporating topologies.\n\nHybrid Topology Using Packet Tracer:\n\nHave 4 network switches which are connected to each other through network cables forming ring.\nThen have central switch which is connected to one of the switches used in forming ring and also to other devices forming star, thus forming hybrid topology.\nEach of the switch is connected all the other switches as well as an end device.\nWe can configure the end devices as seen before and then can send the message to any other device connected to particular network.\n\n\n\nFig. 11.  Hybrid Topology.\n\n\n\nFig. 12.  Hybrid Topology in simulator (Packet Sent).\n\n\nFig. 13.  Hybrid Topology in simulator (Packet lost).\n\nAs we can see in the below image we can send the messages from one device to another and we can also see the status of the message as “Successful” here. If the messages are not sent due to some reasons it will show “Failed” as the status of the message.\n\n\n\nFig. 14.  Status of the sent message in simulator.\n\n\nObservations:\n\n(1)  Which topology or topologies are implemented at your institute?\n(2) If there is a small setup of your office having 10 Computers connected, which  topology you will prefer? Why? \n(3)  Interpret and analyze the output of each topology\nQuiz: (Sufficient space to be provided for the answers)\n\n1. Give Advantages, disadvantages of each topology\n2. Find out application case of each topology\n3. Which topology you will implement in your campus and why?\nSuggested Reference: \n1.https://www.netacad.com/courses/packet-tracer\n2.Computer Networks- A Top-Down approach, Behrouz Forouzan, McGraw Hill\n\nReferences used by the students: (Sufficient space to be provided)\n\nRubric wise marks obtained:\n\n\nExperiment No: 5\n\nAIM: Implement the concept of VLAN using Network Simulator.\n\nDate:\n\nCompetency and Practical Skills: Exploration of network layout and configuration to connect devices with each other to establish VLAN\n\nRelevant CO: CO-5: Implement different types of network using different tools and simulators\n\nObjectives:\t(a) Download network simulator – preferably cisco packet tracer \n(b) Implement VLAN by configuring interconnecting and computing devices.\n(c) Analyze the performance of Network\n\nEquipment/Instruments: Desktop/laptop, Network simulator\n\nTheory: \n\nWhat is VLAN?\nVirtual Local Area Networks or Virtual LANs (VLANs) are a logical group of computers that appear to be on the same LAN irrespective of the configuration of the underlying physical network. \nFeatures of VLANs:\nVLAN ranges:\nSteps to Implement a Virtual Local Area Network (VLAN):\nTake a switch and 4 end devices (PCs), and connect the switch with end devices using Copper Straight-Through cable. While connecting the cables it is needed to select the port through which you want to connect the switch to the end devices.\n\n\nFig. 1.  Configuring VLAN in simulator.\nAs in the above images to connect switch to PC0 choose ‘FastEthernet0/1’ port in the switch and then in PC0 is selected ‘FastEthernet0’ port. Similarly, connect the entire PC with the switch.\n\nNow, to configure two VLANs in which take 2 PC for each VLAN. Separate 2 PCs for each VLAN which are numbered as VLAN 2 and VLAN 3. We cannot use VLAN 1 because it default VLAN used by the switch. Let us assume that the VLAN 2 is being used by the Sales Department of the organization and VLAN 3 being used by the HR Department of the organization\n\nFig. 2.  Configuring  two VLANs in simulator.\n\nProvide the IP addresses and gateways to the end devices as shown in the below image.\n\nFig. 3.  Providing IP address and gateways to end devices.\nNote: To provide IP address and gateways click on the PC you want provide IP address to and then click Desktop -> IP Configuration\n\n\nFig. 4.  Providing IP addresses to VLANs\n\nConfigure the VLAN \nclick on the switch -> go to CLI and press “Enter” then write the following commands to configure the VLANs and provide the names to VLANs.\n\nCommands:\n\nen/enable: Logs you into enable mode, which is also known as user exec mode or privileged mode.\nconfi/configure terminal: Logs you into configuration mode.\nvlan number(except 1): Creates a VLAN and enters VLAN configuration mode for further definitions of specified number of the VLAN.\nname vlan_name: Provides the specified name to the VLAN chosen by the vlan number command. To provide name to VLAN 2 we have to write name Sales after vlan 2 command. To provide name to VLAN 3 we have to write name HR after vlan 3 command.\nexit: Exits from VLAN configuration mode.\n\n\n\n\nFig. 5.  Providing specific name to VLANs\n\nNow, both the VLANs have been configured. To verify whether the VLANs have been activated or not we have to write “show vlan” command. And after pressing Enter we can see both the created VLANs as shown in the   below image.\n\n\n\nFig. 6.  VLANs activation status.\n\nHere we can see in the above image that both the VLANs (VLAN 2 & VLAN3) which are “Sales” & “HR” are successfully configured and are active.\n\nNow, to make the VLANs work properly we have to assign the devices  among the manually configured host which are “VLAN 2(Sales)” & “VLAN 3(HR)”.\n\nTo assign devices among the VLANs we have to write series of commands which are:\n\nconfi/configure terminal: Logs you into configuration mode.\ninterface: Enters interface configuration mode for the specified fast ethernet interface\nswitchport access vlan: Sets the VLAN that the interface belongs to. It means it assigns the previously specified interface using interface command to work in the specific VLAN only if the device from the other VLAN tries to communicate with the specific interface it will not be successful.\n\n\n\nFig. 7. Configuring interface to VLANs \n\nNow we can see in the below image that if we send the message to the device in the same VLAN then the message is sent successfully, but if we send the message to the device in the different VLAN it cannot be sent to successfully.\n\n\nFig. 8. Sending message to different VLAN \nNow to check whether the message can be sent to the device in another VLAN we will click the PC from which we have to send the message and then click “Desktop” and then go to “Command Prompt” and then give command “ping IP address” here the IP address in the command specifies the destination device’s IP address\n\n\nFig. 9. Sending message to same VLAN \n\nAs we can see in the above image if we ping to the device from another VLAN it will not give reply as it is in the other VLAN. But if we ping to the device which is in the same VLAN as the sender is then the message will be successfully sent.\nNow to check whether the message can be sent to the device in another VLAN we will\nclick the PC from which we have to send the message and then click “Desktop” and then\ngo to “Command Prompt” and then give command “ping IP address” here the IP address\nin the command specifies the destination device’s IP address\n\nObservations:\n\n(1)  Differentiate LAN and VLAN.\n(2)  Interpret and analyze the output\n\t\nQuiz: (Sufficient space to be provided for the answers)\n\n1. Give Advantages, disadvantages of VLAN\n2. Find out application case of VLAN\nSuggested Reference: \n1.https://www.netacad.com/courses/packet-tracer \n2.Computer Networks- A Top-Down approach, Behrouz Forouzan, McGraw Hill\n\nReferences used by the students: (Sufficient space to be provided)\n\n\nRubric wise marks obtained:\n\n\n\nExperiment No: 6\n\nAIM:  Implement the concept of static routing.\n\nDate:\n\nCompetency and Practical Skills: Exploration of network routing and configuration to connect devices to establish static routing\n\nRelevant CO: CO-4: Design network architecture, assign IP addressing and apply various networking algorithms\n\n\nObjectives:\t(a) Download network simulator – preferably cisco packet tracer \n(b) Implement static routing algorithm by configuring interconnecting devices and computing devices.\n(c) Analyze the performance of Network\n\nEquipment/Instruments: Desktop/laptop, Network simulator\n\nTheory: \nStatic routing is a form of routing that occurs when a router uses a manually-configured routing entry, rather than information from dynamic routing traffic. \nIn many cases, static routes are manually configured by a network administrator by adding in entries into a routing table, though this may not always be the case. Unlike dynamic routing, static routes are fixed and do not change if the network is changed or reconfigured. \nStatic routing and dynamic routing are not mutually exclusive. Both dynamic routing and static routing are usually used on a router to maximize routing efficiency and to provide backups in the event that dynamic routing information fails to be exchanged. Static routing can also be used in stub networks, or to provide a gateway of last resort.\nImplementation of Static Routing:\n\nTake 2 routers, 2 switches and 4 end devices and connect them as shown in below image. Connect both the routers with each other using Serial DTE cable, and to connect router-switch and switch-end devices use copper straight-through cables.\n\n\nFig. 1. Static routing  \n\nConfigure both the routers and provide them IP addresses as shown in the below images. We need to take care that both the routers be in the same network so that they will be accessible to each other. To achieve the same we need to give IP address to the routers as following: click on router -> go to config -> go to serial 2/0 (in our case) and provide IP as 192.168.1.1 and 192.168.1.2 to router0 and router1 respectively.\n\n\n\nFig. 2. Router configuration   \nNow, we need to connect the router to the switch, for that we need to provide the IP address in the FastEthernet0/0(in our case). In both the routers we will provide 192.168.2.1 and 192.168.3.1 respectively. Here after providing the IP addresses and connecting the router with the switch there are 2 networks are separated which are 192.168.2.0 and 192.168.3.0 hence, now both the routers are connected to switches and also to the end devices via switch.\n\n\n\nFig. 3. Connecting Routers with switch   \n\n\n\nFig. 4. Providing IP address to end devices\n\nProvide the IP addresses and default gateways to the end devices, and be careful about the network they reside in. In our case we give the IP addresses to the end devices as shown above. And the default gateways will be the IP address of the routers they are connected with which are 192.168.1.1 and 192.168.1.2(in our case). To provide IP address and default gateway click on end device -> go to desktop -> go to IP configuration and provide IP address and default gateway to all the end devices.\n\n\nSelect the static routing path from router0 to router 1 and router1 to router0 for that again click on router -> go to config -> go to static available under ROUTING, and provide the details as follows. In network field provide the IP address of the network you want to communicate with which for router0 is 192.168.3.0, it means that the end devices with the IP address containing the 3rd digit as 3 (i.e 192.168.3.2 or 192.168.3.3 in our case) can be communicated through router0. And in next hop field provide the IP address of the router of the network you want to communicate (i.e 192.168.1.2 IP address of router1).\n\n\nRouter0:\n\n\nFig. 5. Providing static routing path from router0\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRouter1:\n\nFig. 6. Providing static routing path from router1\n\nTo check whether the static routing is done or not, check the routing tables of the routers for that select the magnify icon and click on the router you wish to check the routing table and select the routing table from  the dropdown.\n\nRouting table for Router0:\n\n\n\nRouting table Router1:\n\n\nAfter the completion of all the above steps we can say that the static routing concept is implemented successfully by sending the messages from 1 network to the other via the routers.\n\n\n\nObservations:\n\n(1)  What is the range of IP addresses given to Devices?\n(2)  Interpret and analyze the output \n\nQuiz: (Sufficient space to be provided for the answers)\n\n1. Give Advantages, disadvantages of Static routing\n2. Find out application case of Static routing\n3. What is Ethernet?\n\nSuggested Reference: \n1. https://www.netacad.com/courses/packet-tracer \n2. Computer Networks- A Top-Down approach, Behrouz Forouzan, McGraw Hill\n\nReferences used by the students: (Sufficient space to be provided)\n\nRubric wise marks obtained:\n\n\n\nExperiment No: 7\n\nAIM:  Implement the concept of dynamic routing (RIP, OSPF, and BGP).\n\nDate:\n\nCompetency and Practical Skills: Exploration of Routing Algorithms to configure    network.\n\nRelevant CO:  CO-4:  Design network architecture, assign IP addressing and apply various networking algorithms\n\nObjectives:    (a) Download network simulator – preferably cisco packet tracer Configure all workstations \n(b) Implement dynamic routing algorithm (RIP, OSPF, and BGP) by configuring interconnecting devices and computing devices.\n(c) Analyze the performance of Network\n\nEquipment/Instruments: Desktop/laptop, Packet Tracer Software\n\nTheory: \n\n\tWhat Is Dynamic Routing?\nDynamic routing is a networking technique that provides optimal data routing. Unlike static routing, dynamic routing enables routers to select paths according to real-time logical network layout changes.\nDynamic routing uses multiple algorithms and protocols. The most popular are Routing Information Protocol (RIP) and Open Shortest Path First (OSPF).\nDynamic routing protocols allow routers to share information about the network with other routers to allow them to select the best path to reach a destination.\nAbout Dynamic routing :\nAdvantages of dynamic routing:\nDisadvantages of Dynamic Routing:\n1) RIP Routing Protocol\n\nAbout RIP :\n\n  \nSteps To Implement RIP Routing Protocol:\n\nPrepare topology as shown in below figure.\n\nThe network PC is connected to the switch with Copper-Straight through Cable.\n\nEach Switch is connected to the router using Copper-Straight through Cable.\n\nAnd to connect two routers with each other add Serial ports to the router for that turn off the router Select WIC-2T and add it to the router and turn on the router.\n\nTwo routers are connected using serial DTE cable.\n\n\n\nFig. 1. Network using two switch and two routers\n\nSet the IP Address of the each PC with respect to network address for example here PC0   is in the 192.168.1.0 network so the IP address of PC0 is 192.168.1.1.\n\n\n\nFig. 2. Setting up IP address for PC0\nOnce the IP address of each PC is set, set the IP address of the fast Ethernet port of router to which switch is connected. And then turn on the port. Follow the same process for second (Router 1) router.\n\n\n\nFig. 3. Setting up connection with fast Ethernet port for Router0\n\n\n\n\nFig. 4. Setting up connection with fast Ethernet port for Router1\nSet the IP address serial port of all routers.\n\n\n\nFig. 5. Setting up IP address serial port for Router0\n\n\n\nFig. 6. Setting up IP address serial port for Router1\n\nAdd number of network in RIP routing.\n\nTo add number of network - open the settings of router head to the RIP category. And in there add the network address of another network to which we want to connect our router.\nFor example in above image if we want to access network 192.168.1.0 add that network address in network.\nFollow the same process for Router 1. And with this our routing is completed.\n\n\n\nFig. 7. Network using two switch and two routers\n\n\n\nFig. 8. Adding network to RIP\n\n\n\nTest the network. - Transfer the data packet from one network pc to other network pc.\n\n\n\nFig. 9. Transferring the data packet from one network pc to other network pc\n\n\nOSPF Routing Protocol:\n\nOpen Shortest Path First is the dynamic routing protocol used in large to very large IP networks. \nAbout OSPF\nAdvantages of OSPF\nDisadvantages of OSPF\nApplications of OSPF\n\nSteps To Implement OSPF Routing Protocol:\n\nAdd Network Devices in Network As Following:\n\nHere in the network PC is connected to the switch with Copper-Straight through Cable. Each Switch is connected to the router using Copper-Straight through Cable.\n\nTo connect two routers with each other we have to add Serial ports to the router for that turn off the router Select WIC-2T and add it to the router and turn on the router.\n\nThree routers are connected using serial DTE cable.\n\n\n\nFig. 10. Network using two switch and two routers through OSPF\n\n\n2) Set the IP Address of the each PC with respect to network address for example here PC0 is in the 192.168.1.0 network so the IP address of PC0 is 192.168.1.1.\n\n\n\nFig. 11. Setting up the IP Address\n\n\n3) Once the IP address of each PC is set, set the IP address of the fast Ethernet port of router to which switch is connected. And then turn on the port. Follow the same process for second (Router 1) router.\n\n\n\nFig. 12. Setting up connection with fast Ethernet port for Router0\n\n\n\nFig. 13. Setting up connection with fast Ethernet port for Router1\n\n\n\n  Now we will have to set the IP address serial port of all routers.\n\n\n\nFig. 14. Setting up connection with fast Ethernet port for Router0\n\n\n\nFig. 15. Setting up connection with fast Ethernet port for Router1\n\n\n\nFig. 16. Setting up connection with fast Ethernet port for Router2\n\n\nOur network is ready only one thing is left to do which is to add number of network through OSPF Command.\n\n\n\nFig. 17. Setting up connection with Router0 through OSPF\n  \n\nFig. 18. Setting up connection with Router1 through OSPF\n\n\n\nFig. 19. Setting up connection with Router2 through OSPF\n\n\n\nTest the network. Transfer the data packet from one network pc to other network pc.\n\n\n\nFig. 20. Testing the network\n\n\n\n3)   BGP Routing Protocol:\n\nBorder Gateway Protocol (BGP) is the postal service of the Internet. When someone drops a letter into a mailbox, the postal service processes that piece of mail and chooses a fast, efficient route to deliver that letter to its recipient. Similarly, when someone submits data across the Internet, BGP is responsible for looking at all of the available paths that data could travel and picking the best route, which usually means hopping between autonomous systems.\n\nBGP is the protocol that makes the Internet work. It does this by enabling data routing on the Internet. When a user in Singapore loads a website with origin servers in Argentina, BGP is the protocol that enables that communication to happen quickly and efficiently.\n\n\nSteps To Implement BGP Routing Protocol:\n\nDraw BGP Topology Diagram:\n\n\n\nFig. 21. BGP Topology Diagram\n\n\nAssign ip address on each device as mentioned in Diagram:\n\n\n\nFig. 22. Assigning IP address to PC0\n\n\nFig. 23. Assigning IP address to PC2\n\n\nBGP configuration on Router 1:\n\nR1(config)#router bgp 1\nR1(config-router)#neighbor 172.16.0.2 remote-as 71\nR1(config-router)#network 10.0.0.0 mask 255.0.0.0\nR1(config-router)#exit\nR1(config)#do write\nBuilding configuration...[OK]\nR1(config)#\n\nBGP configuration on Router 2:\n\nR2(config)#router bgp 71\nR2(config-router)#neighbor 172.16.0.1 remote-as 1\nR2(config-router)#neighbor 172.14.0.2 remote-as 79\nR2(config-router)#network 40.0.0.0 mask 255.0.0.0\nR2(config-router)#exit\nR2(config)#do write\nBuilding configuration...[OK]\nR2(config)#\n\nBGP Configuration on Router 3:\n\nR3(config)#router bgp 79\nR3(config-router)#neighbor 172.14.0.1 remote-as 71\nR3(config-router)#network 40.0.0.0 mask 255.0.0.0\nR3(config-router)#exit\nR3(config)#do write\nBuilding configuration...[OK\nR3(config)#\n\n\n\nFig. 23. Testing the Network\n\n\nObservations:\n\n(1)  Find out the algorithms/ protocol used in your network\n(2)  Give name of protocol of which the packets sent for testing\n\nQuiz: (Sufficient space to be provided for the answers)\n\n1. Differentiate static and dynamic algorithm\n2. What is the approximate cost of establishing the network of 10 devices? (Take devices as per your requirements and choice) give details\n\nSuggested Reference: \n1. https://www.netacad.com/courses/packet-tracer \n2. Computer Networks- A Top-Down approach, Behrouz Forouzan, McGraw Hill\n\nReferences used by the students: (Sufficient space to be provided)\n\n\n\n\n\n\nRubric wise marks obtained:\n\n\n\n\nExperiment No: 8\n\nAIM:  To Simulate Web Server configuration using Cisco Packet tracer simulator.\n\nDate:\n\nCompetency and Practical Skills: Exploration of network routing and configuration to connect devices to establish static routing\n\nRelevant CO: CO-2: Explain work of layers of OSI and TCP/IP model according to how they can be used to assist in   network design and implementation.\n\nObjectives:\t(a) Download network simulator – preferably cisco packet tracer \n(b) Configure a simulated web server and establish connections between devices.\n(c) Gain hands-on experience in setting up a Virtual Local Area Network.\n\nEquipment/Instruments: Desktop/laptop, Network simulator\n\nTheory: \nA web server is a specialized computer system that stores and delivers web content to clients, usually web browsers, upon request. In this experiment, we will virtually configure a web server using Cisco Packet Tracer, which is a network simulation tool that allows us to create and interact with network topologies..\nImplementation of Web Server configuration:\n\nSelect End devices as mentioned below.\nRouter (Router-PT) \nSwitch (Switch-PT) \nPC0 and PC1 \n3 Servers (Server-PT)\n\nConnect PC0 and PC1 with switch, Switch to Router, and Servers to Switch (Refer the figure given below)\n\nSelect Switch-PT. Switch it off. Select the second module from the left pan of physical configuration. Place it on the area of RJ-45 connectors. Switch it on.\nConfigure Router:\nClick on Router -> Click on Config -> Select fast Ethernet0/0 from the tabs   \nSet IP – 192.168.1.1 and Then Tick mark the check box of ‘Port Status’.\n\nCall CLI -> Press Enter. \nType IP dhcp pool netA and Press Enter\nType network 192.168.1.0 255.255.255.0 and Press Enter\nType default-router 192.168.1.1\nExit \nConfigure Servers:\nClick Server 0 -> Rename to Web\nClick Server 1 -> Rename to DNS \nClick Server 0 -> Rename to DHCP\nConfigure PCs:\nClick on PC0-> Select Desktop -> Set radio button of  ‘DHCP’ to ON\nClick on PC0-> Select Desktop -> Set radio button of  ‘DHCP’ to ON\nSelect DHCP server -> Select Desktop -> Set IP to 192.168.1.4, default gateway to 192.168.1.1, DNS to 192.168.1.5\nSelect DNS server -> Select Desktop -> Set IP to 192.168.1.5, default gateway to 192.168.1.1, DNS to 192.168.1.5\nSet the mappings of IP and name of the website (e.g cn.edu)\nSelect Web server -> Select Desktop -> Set IP to 192.168.1.6, default gateway to 192.168.1.1, DNS to 192.168.1.5\nSelect service HTTP in Web server.\nEdit the index page as per your need. (e.g Welcome to Computer Network Lab)\n\nTo test the web server through through DNS and DHCP\nSelect PC0 -> Select Desktop -> Select Browser -> Type the http://192.168.1.6 or http://www.cnlab.edu\nSelect PC0 -> Select Desktop -> Select Email -> Select ‘Receive’. It will display the email conversation done so far.\n\n\n\n\nObservations:\n\nHow was the overall network performance during interactions between clients and the web server? \nWas the web server successfully configured and set up?\nDid you observe any patterns in network traffic during interactions between clients and the web server?\n\nQuiz: (Sufficient space to be provided for the answers)\n\n1. Explain the significance of a web server in the context of internet communication.\n2. Outline the general steps involved in simulating web server configuration using   Cisco Packet Tracer.\nSuggested Reference: \n1. https://www.netacad.com/courses/packet-tracer \n2. Computer Networks- A Top-Down approach, Behrouz Forouzan, McGraw Hill\n\nReferences used by the students: (Sufficient space to be provided)\n\nRubric wise marks obtained:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nExperiment No: 9\n\nAIM:  To Simulate E-mail Server configuration using Cisco Packet tracer simulator.\n\nDate:\n\nCompetency and Practical Skills: Exploration of network routing and configuration to connect devices to establish static routing\n\nRelevant CO: CO-2: Explain work of layers of OSI and TCP/IP model according to how they can be used to assist in   network design and implementation.\n\n\nObjectives:\t(a) Gain an understanding of the fundamental concepts of an e-mail server, \n(b) Simulate the setup of an e-mail server by configuring relevant software,\n(c) Gain hands-on experience in setting up a Virtual Local Area Network.\n\nEquipment/Instruments: Desktop/laptop, Network simulator\n\nTheory: \nAn email server handles the sending, receiving, and storing of email messages. It operates based on standard protocols such as SMTP (Simple Mail Transfer Protocol) for sending emails and IMAP (Internet Message Access Protocol) or POP3 (Post Office Protocol) for receiving and storing emails. In this experiment, we will virtually configure an email server using Cisco Packet Tracer, allowing participants to explore the intricacies of email communication within a simulated network.\nImplementation of Web Server configuration:\n\nSelect End devices as mentioned below.\nServer (Server-PT) \nRouter (Router-PT) \nSwitch (Switch-PT) \nPC0 PC1 and PC2\n\nConnect all three PCs to Switch, Switch to Router and then Router to Server. (Refer the figure given  above)\nConfigure Router:\nClick on Router -> Click on Config -> Select fast Ethernet0/0 from the tabs   \nSet IP – 192.168.1.1 and Then Tick mark the check box of ‘Port Status’.\n\nClick on Router -> Click on Config -> Select fast Ethernet1/1 from the tabs\nSet IP – 192.168.2.1 and Then Tick mark the check box of ‘Port Status’.\n\nConfigure PCs:\nClick PC0 -> Select Desktop -> Select IP Configuration -> Set IP 192.168.1.2 and Default Gateway as 192.168.1.1\nClick PC1 -> Select Desktop -> Select IP Configuration -> Set IP 192.168.1.2 and Default Gateway as 192.168.1.2\nClick PC2 -> Select Desktop -> Select IP Configuration -> Set IP 192.168.1.2 and Default Gateway as 192.168.1.3\nConfigure Server:\nClick on Server-> Select Services -> Make sure SMTP and POP services radio buttons are marked ‘ON’.\nSet domain name e.g http://www.cnlab.edu\nSet username and password for each individual PCs connected on machine,      \nUsername                     password\npc0                                 pc0 \npc1                                 pc1\npc2                                 pc2\nclick on Desktop -> set IP 192.168.2.2 and Default Gateway 192.168.2.1\nSelect PC0 -> Select Desktop -> Select Email -> Select Configuration Email (by default the screen appears first time)\nSet the value for each key as follows: \nYour Name: PC0, Email Address:pc0@cn.edu, Incoming Mail Server:192.168.2.2, Outgoing Mail Server:192.168.2.2\nUsername:pc0, password:pc0\nRepeat the steps for the PC1 and PC2\nTo test the email conversation through email server\nSelect PC0 -> Select Desktop -> Select Email -> Select ‘Compose’ -> Put the address, subject and email text\nRepeat the steps for PC1 and PC2 and then\nSelect PC0 -> Select Desktop -> Select Email -> Select ‘Receive’. It will display the email conversation done so far.\n\nObservations:\n\nObserving the installation and configuration process of the e-mail server software on the designated server device.\nObserving the interaction between the configured e-mail server and the client devices.\n\nQuiz: (Sufficient space to be provided for the answers)\n\nExplain two benefits of using Cisco Packet Tracer to simulate e-mail server configuration. \nBriefly describe the purpose of SMTP and IMAP/POP3 in the context of email communication\n\nSuggested Reference: \nhttps://www.netacad.com/courses/packet-tracer \nComputer Networks- A Top-Down approach, Behrouz Forouzan, McGraw Hill\n\nReferences used by the students: (Sufficient space to be provided)\n\nRubric wise marks obtained:\n\n\n\n\n\n\n\n\n\nExperiment No: 10\n\nAIM: Packet capture and header analysis by wire-shark (TCP, UDP, IP).\n\nDate:\n\nCompetency and Practical Skills: Exploration of Network protocols and header using wireshark tool\n\nRelevant CO:  CO3:  Examine work of protocols of TCP/IP protocol suite.\n\nObjectives:\t(a) Download Wireshark.\n\t\t(b) Capture the Packet\n(c) Perform header analysis\n(d) Answer the given questions with screenshots\n\nEquipment/Instruments: Desktop/laptop\n\nTheory: \n\n\tWhat is wireshark?\nWireshark is an open-source packet analyzer, which is used for education, analysis, software development, communication protocol development, and network troubleshooting.\nHow to capture Packet in Wireshark?\nConnect to Router from which you want to capture packet.\nNext step is to launch wireshark in your pc.\nClick on capture to start capturing the packets with optional filter option.\n\n\nFig. 1. Wireshark Network Analyzer\n\n\n\n\nCapture Different Types of packets and analyze them:\nTCP Packets:\n\n\n\nFig. 2. Capturing TCP packet from Wireless Network\n\nUDP Packets:\n\n\n\nFig. 3. Capturing UDP packet from Wireless Network\nObservations:\n\nUse Wireshark tool and explore the packet format and content at each TCP/IP layer\nAnswer following questions for one packet\n(1)  What is the source and destination IP address?\n(2)  What is the MAC address of source and destination?\n(3) What is the port address of source and destination?\n(4) What is the TTL fields value in IP layer of the packet\nAdd screenshots of all above answers in your document.\n\n\nQuiz: (Sufficient space to be provided for the answers)\n\n1. Explain various planes or windows shown in user interface of Wireshark tool\n2. What is the use of Wireshark tool?\n3. Explore various important options available in Wireshark tool\n\nSuggested Reference: https://www.wireshark.org/\n\nReferences used by the students: (Sufficient space to be provided)\n\nRubric wise marks obtained:\n\n\n\n\n\n\n\n\nCourse Outcomes (COs):\nFamiliarize with the basic taxonomy - terminologies used in networking and the layered architecture of computer networks.\nExplain work of layers of OSI and TCP/IP model according to how they can be used to assist in network design and implementation.\nExamine work of protocols of TCP/IP protocol suite.\nDesign network architecture, assign IP addressing and apply various networking algorithms\nImplement different types of network using different tools and simulators.\nCourse Outcomes (COs):\nFamiliarize with the basic taxonomy - terminologies used in networking and the layered architecture of computer networks.\nExplain work of layers of OSI and TCP/IP model according to how they can be used to assist in network design and implementation.\nExamine work of protocols of TCP/IP protocol suite.\nDesign network architecture, assign IP addressing and apply various networking algorithms\nImplement different types of network using different tools and simulators.\nCourse Outcomes (COs):\nFamiliarize with the basic taxonomy - terminologies used in networking and the layered architecture of computer networks.\nExplain work of layers of OSI and TCP/IP model according to how they can be used to assist in network design and implementation.\nExamine work of protocols of TCP/IP protocol suite.\nDesign network architecture, assign IP addressing and apply various networking algorithms\nImplement different types of network using different tools and simulators.\nCourse Outcomes (COs):\nFamiliarize with the basic taxonomy - terminologies used in networking and the layered architecture of computer networks.\nExplain work of layers of OSI and TCP/IP model according to how they can be used to assist in network design and implementation.\nExamine work of protocols of TCP/IP protocol suite.\nDesign network architecture, assign IP addressing and apply various networking algorithms\nImplement different types of network using different tools and simulators.\nCourse Outcomes (COs):\nFamiliarize with the basic taxonomy - terminologies used in networking and the layered architecture of computer networks.\nExplain work of layers of OSI and TCP/IP model according to how they can be used to assist in network design and implementation.\nExamine work of protocols of TCP/IP protocol suite.\nDesign network architecture, assign IP addressing and apply various networking algorithms\nImplement different types of network using different tools and simulators.\nCourse Outcomes (COs):\nFamiliarize with the basic taxonomy - terminologies used in networking and the layered architecture of computer networks.\nExplain work of layers of OSI and TCP/IP model according to how they can be used to assist in network design and implementation.\nExamine work of protocols of TCP/IP protocol suite.\nDesign network architecture, assign IP addressing and apply various networking algorithms\nImplement different types of network using different tools and simulators.\nCourse Outcomes (COs):\nFamiliarize with the basic taxonomy - terminologies used in networking and the layered architecture of computer networks.\nExplain work of layers of OSI and TCP/IP model according to how they can be used to assist in network design and implementation.\nExamine work of protocols of TCP/IP protocol suite.\nDesign network architecture, assign IP addressing and apply various networking algorithms\nImplement different types of network using different tools and simulators.\nCourse Outcomes (COs):\nFamiliarize with the basic taxonomy - terminologies used in networking and the layered architecture of computer networks.\nExplain work of layers of OSI and TCP/IP model according to how they can be used to assist in network design and implementation.\nExamine work of protocols of TCP/IP protocol suite.\nDesign network architecture, assign IP addressing and apply various networking algorithms\nImplement different types of network using different tools and simulators.\nSr. No.\nObjective(s) of Experiment\nPlatform to be used\nCO\n1\nCO\n2\nCO\n3\nCO\n4\nCO\n5\nCO\n5\n1.\nStudy of different network devices in detail\nNetwork Devices\n√\n\n\n\n\n\n2.\nStudy of different types of network cables and practically implement the cross-wired cable and straight through cable using clamping tool.\nCables, Clamping tool, Connectors\n√\n\n\n\n√\n√\n3.\nPerform basic network command and Network configuration commands\nComputer\n√\n\n\n\n\n\n4.\nImplement different LAN topologies using Network Simulator \nCisco Packet tracer\n\n\n\n\n√\n√\n5.\nImplement the concept of VLAN using Network Simulator.\nCisco Packet tracer\n\n\n\n\n√\n√\n6.\nImplement the concept of static routing.\nCisco Packet tracer\n\n\n\n√\n\n\n7.\nImplement the concept of dynamic routing (RIP, OSPF, BGP).\nCisco Packet tracer\n\n\n\n√\n\n\n8.\nTo Simulate Web Server configuration using Cisco Packet tracer emulator.\nCisco Packet tracer\n\n√\n\n\n\n\n9.\nTo Simulate Email Server configuration using Cisco Packet tracer emulator.\nCisco Packet tracer\n\n√\n\n\n\n\n10.\nPacket capture and header analysis by wire-shark (TCP,UDP,IP)\nWireshark\n\n\n√\n\n\n\nSr. No.\nObjective(s) of Experiment\nPage No.\nDate of performance\nDate of submission\nAssessment\nMarks\nSign. of\nTeacher with date\nRemarks\n1.\nStudy of different network devices in detail\n\n\n\n\n\n\n2.\nStudy of different types of network cables and practically implement the cross-wired cable and straight through cable using clamping tool.\n\n\n\n\n\n\n3.\nPerform basic network command and Network configuration commands\n\n\n\n\n\n\n4.\nImplement different LAN topologies using Network Simulator \n\n\n\n\n\n\n5.\nImplement the concept of VLAN using Network Simulator.\n\n\n\n\n\n\n6.\nImplement the concept of static routing.\n\n\n\n\n\n\n7.\nImplement the concept of dynamic routing (RIP, OSPF, BGP).\n\n\n\n\n\n\n8.\nTo Simulate Web Server configuration using Cisco Packet tracer emulator.\n\n\n\n\n\n\n9.\nTo Simulate Email Server configuration using Cisco Packet tracer emulator.\n\n\n\n\n\n\n10.\nPacket capture and header analysis by wire-shark (TCP,UDP,IP)\n\n\n\n\n\n\nTotal\nTotal\nTotal\nTotal\nTotal\n\n\n\nRubrics\nPractical Understanding\nPractical Understanding\nProblem Solving\nProblem Solving\nTask Execution\nTask Execution\nDocumentation and Reporting\nDocumentation and Reporting\nEthical and Professional Conduct\nEthical and Professional Conduct\nTotal\nRubrics\nGood (2)\nAvg.\n(1)\nGood (2)\nAvg. (1)\nGood (2)\nAvg. (1)\nGood (2)\nAvg. \n(1)\nGood (2)\nAvg. (1)\nTotal\nMarks\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRubrics\nPractical Understanding\nPractical Understanding\nProblem Solving\nProblem Solving\nTask Execution\nTask Execution\nDocumentation and Reporting\nDocumentation and Reporting\nEthical and Professional Conduct\nEthical and Professional Conduct\nTotal\nRubrics\nGood (2)\nAvg.\n(1)\nGood (2)\nAvg. (1)\nGood (2)\nAvg. (1)\nGood (2)\nAvg. \n(1)\nGood (2)\nAvg. (1)\nTotal\nMarks\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRubrics\nPractical Understanding\nPractical Understanding\nProblem Solving\nProblem Solving\nTask Execution\nTask Execution\nDocumentation and Reporting\nDocumentation and Reporting\nEthical and Professional Conduct\nEthical and Professional Conduct\nTotal\nRubrics\nGood (2)\nAvg.\n(1)\nGood (2)\nAvg. (1)\nGood (2)\nAvg. (1)\nGood (2)\nAvg. \n(1)\nGood (2)\nAvg. (1)\nTotal\nMarks\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRubrics\nTopology Selection and Understanding\nTopology Selection and Understanding\nTopology Implementation\nTopology Implementation\nSimulation and Testing\nSimulation and Testing\nDocumentation and Reporting\nDocumentation and Reporting\nEthical and Professional Conduct\nEthical and Professional Conduct\nTotal\nRubrics\nGood (2)\nAvg. (1)\nGood (2)\nAvg.\n(1)\nGood (2)\nAvg. (1)\nGood (2)\nAvg.\n(1)\nGood (2)\nAvg. (1)\nTotal\nMarks\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRubrics\nTopology Selection and Understanding\nTopology Selection and Understanding\nTopology Implementation\nTopology Implementation\nSimulation and Testing\nSimulation and Testing\nDocumentation and Reporting\nDocumentation and Reporting\nEthical and Professional Conduct\nEthical and Professional Conduct\nTotal\nRubrics\nGood (2)\nAvg. (1)\nGood (2)\nAvg.\n(1)\nGood (2)\nAvg. (1)\nGood (2)\nAvg.\n(1)\nGood (2)\nAvg. (1)\nTotal\nMarks\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRubrics\nTopology Selection and Understanding\nTopology Selection and Understanding\nTopology Implementation\nTopology Implementation\nSimulation and Testing\nSimulation and Testing\nDocumentation and Reporting\nDocumentation and Reporting\nEthical and Professional Conduct\nEthical and Professional Conduct\nTotal\nRubrics\nGood (2)\nAvg. (1)\nGood (2)\nAvg.\n(1)\nGood (2)\nAvg. (1)\nGood (2)\nAvg.\n(1)\nGood (2)\nAvg. (1)\nTotal\nMarks\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRubrics\nTopology Selection and Understanding\nTopology Selection and Understanding\nTopology Implementation\nTopology Implementation\nSimulation and Testing\nSimulation and Testing\nDocumentation and Reporting\nDocumentation and Reporting\nEthical and Professional Conduct\nEthical and Professional Conduct\nTotal\nRubrics\nGood (2)\nAvg. (1)\nGood (2)\nAvg.\n(1)\nGood (2)\nAvg. (1)\nGood (2)\nAvg.\n(1)\nGood (2)\nAvg. (1)\nTotal\nMarks\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRubrics\nUnderstanding of Web Server Configuration\nUnderstanding of Web Server Configuration\nConfiguration and Connectivity\nConfiguration and Connectivity\nTroubleshooting and Problem-Solving\nTroubleshooting and Problem-Solving\nPerformance Analysis and Evaluation\nPerformance Analysis and Evaluation\nDocumentation and Reporting\nDocumentation and Reporting\nTotal\nRubrics\nGood (2)\nAvg. (1)\nGood (2)\nAvg.\n(1)\nGood (2)\nAvg. (1)\nGood (2)\nAvg.\n(1)\nGood (2)\nAvg. (1)\nTotal\nMarks\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRubrics\nUnderstanding of E-mail Server Configuration\nUnderstanding of E-mail Server Configuration\nConfiguration and Connectivity\nConfiguration and Connectivity\nTroubleshooting and Problem-Solving\nTroubleshooting and Problem-Solving\nPerformance Analysis and Evaluation\nPerformance Analysis and Evaluation\nDocumentation and Reporting\nDocumentation and Reporting\nTotal\nRubrics\nGood (2)\nAvg. (1)\nGood (2)\nAvg.\n(1)\nGood (2)\nAvg. (1)\nGood (2)\nAvg.\n(1)\nGood (2)\nAvg. (1)\nTotal\nMarks\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRubrics\nUnderstanding of Protocols\nUnderstanding of Protocols\nEffective Packet Capture\nEffective Packet Capture\nHeader Analysis\nHeader Analysis\nProblem Solving and Troubleshooting\nProblem Solving and Troubleshooting\nDocumentation and Reporting\nDocumentation and Reporting\nTotal\nRubrics\nGood (2)\nAvg. (1)\nGood (2)\nAvg.\n(1)\nGood (2)\nAvg. (1)\nGood (2)\nAvg.\n(1)\nGood (2)\nAvg. (1)\nTotal\nMarks\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
  "question_indices": [
    395,
    445,
    446,
    447,
    530,
    573,
    652,
    653,
    654,
    825,
    969,
    990,
    1026,
    1027,
    1028,
    1030,
    1031,
    1137,
    1138,
    1140,
    1141,
    1241,
    1242,
    1243,
    1246,
    1247,
    1497,
    1498,
    1501,
    1502,
    1583,
    1584,
    1586,
    1587,
    1755,
    1756,
    1757
  ],
  "question_texts": [
    "NIC:",
    "Find out the cases where above devices are used?",
    "Differentiate each device?",
    "Give approximate cost of each device with name of 2 manufactures.",
    "Twisted Pair Cable",
    "Fiber Optical Cable",
    "Find out the cases where above cables are used?",
    "Differentiate each device.",
    "Give approximate cost of each cable with name of 2 manufactures.",
    "Give the sequence of troubleshoots commands you will perform with proper justification if your network is not working.",
    "Mesh Topology:",
    "Hybrid Topology:",
    "Give Advantages, disadvantages of each topology",
    "Find out application case of each topology",
    "Which topology you will implement in your campus and why?",
    "https://www.netacad.com/courses/packet-tracer",
    "Computer Networks- A Top-Down approach, Behrouz Forouzan, McGraw Hill",
    "Give Advantages, disadvantages of VLAN",
    "Find out application case of VLAN",
    "https://www.netacad.com/courses/packet-tracer",
    "Computer Networks- A Top-Down approach, Behrouz Forouzan, McGraw Hill",
    "Give Advantages, disadvantages of Static routing",
    "Find out application case of Static routing",
    "What is Ethernet?",
    "https://www.netacad.com/courses/packet-tracer",
    "Computer Networks- A Top-Down approach, Behrouz Forouzan, McGraw Hill",
    "Differentiate static and dynamic algorithm",
    "What is the approximate cost of establishing the network of 10 devices? (Take devices as per your requirements and choice) give details",
    "https://www.netacad.com/courses/packet-tracer",
    "Computer Networks- A Top-Down approach, Behrouz Forouzan, McGraw Hill",
    "Explain the significance of a web server in the context of internet communication.",
    "Outline the general steps involved in simulating web server configuration using   Cisco Packet Tracer.",
    "https://www.netacad.com/courses/packet-tracer",
    "Computer Networks- A Top-Down approach, Behrouz Forouzan, McGraw Hill",
    "Explain various planes or windows shown in user interface of Wireshark tool",
    "What is the use of Wireshark tool?",
    "Explore various important options available in Wireshark tool"
  ],
  "question_formats": [
    {
      "font_name": null,
      "font_size": null,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": "39:50:57",
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    },
    {
      "font_name": null,
      "font_size": 12.0,
      "font_color": null,
      "alignment": "JUSTIFY (3)"
    }
  ]
}